src/Documents/Реализация/Реализация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Реализация</name>
  <basedOn>Document.ЗаказНаряд</basedOn>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.УчетЗатрат</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.МатериалыЗаказчиков</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыКлиентов</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <comment>Клиент</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказНаряд</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериалыЗаказчика</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеМатериала</name>
      <type>
        <types>EnumRef.СостояниеМатериаловКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>Использован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Реализация/Forms/ФормаДокумента/Module.bsl
// Форма документа "Реализация".
// Обеспечивает интерактивное заполнение, автоматическую подстановку цен,
// пересчёт сумм в строках табличных частей и итоговой суммы документа.

// ============================================================
//  Серверные обработчики
// ============================================================

// При создании нового документа на сервере:
//   - Если ответственный не заполнен, подставляем текущего пользователя
//     из параметров сеанса (ссылка на элемент справочника "Пользователи").
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
        Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
    КонецЕсли;
КонецПроцедуры

// ============================================================
//  Клиентские процедуры пересчёта итоговой суммы документа
// ============================================================

// Пересчитывает итоговую сумму документа как сумму итогов колонки "Сумма"
// по обеим табличным частям: Товары и Услуги.
&НаКлиенте
Процедура ПересчётСуммыДокумента()
    Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
КонецПроцедуры

// ============================================================
//  Обработчики табличной части "Товары"
// ============================================================

// Изменение количества в строке товара:
//   - пересчитываем сумму в строке (Цена * Количество) через общий модуль,
//   - обновляем итоговую сумму документа.
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
    СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
    Если СтрокаТЧ <> Неопределено Тогда
        РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
        ПересчётСуммыДокумента();
    КонецЕсли;
КонецПроцедуры

// Изменение цены в строке товара – аналогично пересчитываем строку и итог.
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
    СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
    Если СтрокаТЧ <> Неопределено Тогда
        РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
        ПересчётСуммыДокумента(); 
    КонецЕсли;
КонецПроцедуры                             

// При выборе номенклатуры в строке товара:
//   - если товар выбран, получаем его розничную цену на дату документа
//     с помощью функции общего модуля (серверный вызов);
//   - если товар сброшен, цена обнуляется;
//   - пересчитываем сумму строки и итоговую сумму документа.
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
    СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
    Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
        СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуПродажиНаДату(СтрокаТЧ.Номенклатура, , Объект.Дата);
    Иначе
        СтрокаТЧ.Цена = 0;
    КонецЕсли;
    РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
    ПересчётСуммыДокумента();
КонецПроцедуры 

// При начале редактирования новой строки (копирование существующей):
//   - итоговая сумма пересчитывается, так как добавляется новая строка с ненулевой суммой.
&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
    Если Копирование Тогда
        ПересчётСуммыДокумента();
    КонецЕсли;    
КонецПроцедуры

// После удаления строки товара пересчитываем итоговую сумму.
&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
    ПересчётСуммыДокумента();
КонецПроцедуры

// ============================================================
//  Обработчики табличной части "Услуги"
// ============================================================

// Изменение количества в строке услуги: пересчёт строки и итога.
&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
    СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
    Если СтрокаТЧ <> Неопределено Тогда
        РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
        ПересчётСуммыДокумента();
    КонецЕсли;
КонецПроцедуры

// Изменение цены в строке услуги: пересчёт строки и итога.
&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
    СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
    Если СтрокаТЧ <> Неопределено Тогда
        РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
        ПересчётСуммыДокумента();
    КонецЕсли;
КонецПроцедуры

// При выборе услуги в строке:
//   - если услуга выбрана, получаем её розничную цену на дату документа;
//   - если услуга сброшена, цена обнуляется;
//   - пересчитываем сумму строки и итоговую сумму документа.
&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
    СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
    Если ЗначениеЗаполнено(СтрокаТЧ.Услуга) Тогда
        СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуПродажиНаДату(СтрокаТЧ.Услуга, , Объект.Дата);
    Иначе
        СтрокаТЧ.Цена = 0;
    КонецЕсли;
    РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
    ПересчётСуммыДокумента();
КонецПроцедуры

// При начале редактирования новой строки (копирование) – пересчёт итога.
&НаКлиенте
Процедура УслугиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
    Если Копирование Тогда
        ПересчётСуммыДокумента();
    КонецЕсли;
КонецПроцедуры

// После удаления строки услуг пересчитываем итоговую сумму.
&НаКлиенте
Процедура УслугиПослеУдаления(Элемент)
	ПересчётСуммыДокумента();
КонецПроцедуры
